Revit 2027 API
DockablePaneState.SetFloatingRectangle Method
 When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFloatingRectangle(
	Rectangle rect
)
Public Sub SetFloatingRectangle (
	rect As Rectangle
)
public:
void SetFloatingRectangle(
	Rectangle^ rect
)
member SetFloatingRectangle :
        rect : Rectangle -> unit
Parameters
rect Rectangle
 The rectangle to use when floating.
Exceptions
Exception | Condition
ArgumentException |  Rectangle is not normalized.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace